Repository: paavkar/AgricultureApp
Catalog: AgricultureApp.SharedKernel/Localization/AgricultureAppLoc.*.resx
Languages: fi_fi

# CultFarmNotFound
source: Cultivating farm not found.
fi_fi: Viljelevää maatilaa ei löytynyt.

# CultivatingFarmNotAuthorizedFC
source: The user is not authorized to perform this action on cultivations on the farm.
fi_fi: Käyttäjää ei ole sallittu suorittamaan toimintoa peltoihin liittyen tällä maatilalla.

# CultivationFailed
source: Failed to add field cultivation.
fi_fi: Pellon viljelyn lisääminen epäonnistui.

# FieldIdNotMatchingURL
source: Field ID doesn't match the one in the URL.
fi_fi: Pellon ID ei vastaa URL:ssa olevaa ID:tä.

# FieldStatusUpdateFailed
source: Failed to update field status.
fi_fi: Pellon tilan päivitys epäonnistui.

# InvalidLogin
source: Invalid login attempt.
fi_fi: Virheellinen kirjautumisyritys.

# InvalidRefresh
source: Invalid or expired refresh token.
fi_fi: Virheellinen tai vanhentunut päivitystunnus.

# CultivatingFarmNotAuthorizedF
source: The user is not authorized to update fields in the cultivating farm.
fi_fi: Käyttäjää ei ole sallittu päivittämään pellon tietoja viljelevällä maatilalla.

# RefreshRevoked
source: Refresh token revoked.
fi_fi: Päivitystunnus evätty.

source: User authentication failed.
fi_fi: Käyttäjän autentikointi epäonnistui.

source: User not found.
fi_fi: Käyttäjää ei löytynyt.

# CultivatedFieldNotFound
source: The farm is not currently cultivating the given field.
fi_fi: Maatila ei omista peltoa kylväjän roolissa.

# FieldHarvestUpdateFailed
source: Update for field harvest failed.
fi_fi: Pellon sadonkorjuun päivittäminen epäonnistui.

# FieldCultivationStatusUpdateFailed
source: Updating the cultivation status of the field failed.
fi_fi: Pellon viljelystatuksen päivittäminen epäonnistui.

# CultivationIdNotMatchingURL
source: The given cultivation ID must match the on in the URL.
fi_fi: Annetun viljelyn ID:n täytyy olla sama URL:n ID:n kanssa.

# FieldCultivationDeleteFailed
source: Deleting the field cultivation failed.
fi_fi: Pellon viljelyn poistaminen epäonnistui.

# CultivationNotFound
source: No field cultivation found with given ID.
fi_fi: Pellon viljelyä ei löytynyt annetulla ID:llä.

# HarvestDateBeforePlantingDate
source: Harvest date cannot be the same or before the planting date.
fi_fi: Sadonkorjuun päivämäärä ei voi olla sama tai aikaisemmin, kuin viljelyn päivämäärä.

# ActualYieldNegative
source: Yield cannot be negative.
fi_fi: Sadonkorjuun tuotto ei voi olla negatiivinen.

source: Field not found.
fi_fi: Peltoa ei löytynyt.

source: Owner farm not found.
fi_fi: Pellon omistavaa maatilaa ei löytynyt.

# UserNotAuthorizedField
source: User is not authorized to perform this action related to fields.
fi_fi: Käyttäjää ei ole sallittu tekemään tätä toimintoa liittyen peltoihin.

# FirstAssistantMessage
source: Hello there. How may I help you today?
fi_fi: Terve siellä. Kuinka voin auttaa sinua tänään?

# FarmId
source: Farm ID: {0}.
fi_fi: Maatilan ID: {0}.

# ActionForbidden
source: You are not authorized to perform this action.
fi_fi: Sinua ei ole sallittu tekemään tätä toimintoa.

# FarmIdNotMatchingURL
source: Farm ID doesn't match the one in the URL.
fi_fi: Maatilan ID ei vastaa URL:ssa olevaa ID:tä.

# EmailMustBeProvided
source: Email of the manager must be provided to be able to add a manager.
fi_fi: Hallinnoijan sähköposti on annettava lisätäksesi maatilan hallinnoijaksi.

# ManagerIdMustBeProvided
source: Id belonging to a farm manager must be provided.
fi_fi: Maatilan hallinnoijan id on annettava.

# FarmIdNotMatchingField
source: Farm ID and the field owner ID must match.
fi_fi: Maatilan ja pellon omistajan ID on oltava samat.

# FarmNotFound
source: Farm not found with given ID.
fi_fi: Maatilaa ei löytynyt annetulla ID:llä.

# FailedToCreateFarm
source: Failed to add farm to the database.
fi_fi: Maatilan lisääminen tietokantaan epäonnistui.

# DatabaseErrorFarmsFetch
source: A database error occurred when trying to retrieve items.
fi_fi: Tietokantavirhe esiintyi yrittäessä hakea maatiloja.

# UpdateFarmFailed
source: Failed to update farm.
fi_fi: Maatilan päivitys epäonnistui.

# DeleteFarmFailed
source: Failed to delete farm.
fi_fi: Maatilan poistaminen epäonnistui.

# OnlyFarmOwnerPermittedManagers
source: Only the farm owner can manage managers.
fi_fi: Vain maatilan omistaja voi hallinnoida maatilan hallinnoijia.

# UserNotFoundEmail
source: User was not found with given email.
fi_fi: Annetulla sähköpostilla ei löytynyt käyttäjää.

# FarmOwnerNotManager
source: The owner cannot be added as a manager.
fi_fi: Maatilan omistajaa ei voi lisätä saman maatilan hallinnoijaksi.

# AddManagerFailed
source: Failed to add manager to farm.
fi_fi: Hallinnoijan lisääminen maatilalle epäonnistui.

# DeleteManagerFailed
source: Failed to remove manager with given ID from farm.
fi_fi: Maatilan hallinnoijan poistaminen epäonnistui.

# FieldAlreadyExists
source: Field with the same name already exists in the owner farm.
fi_fi: Maatila omistaa jo pellon tällä nimellä.

# CreateFieldFailed
source: Field creation failed.
fi_fi: Pellon lisääminen epäonnistui.

# UpdateFieldFarm
source: Failed to update field's current farm.
fi_fi: Pellon viljelevän maatilan päivittäminen epäonnistui.

# FieldSizeValidation
source: Field's size must be more than 0.
fi_fi: Pellon koon tulee olla enemmän kuin 0.

# UniqueFieldValidation
source: Field must have a unique name within farm's owned fields.
fi_fi: Pellolla tulee olla uniikki nimi maatilan omistamien peltojen kesken.

# UpdateFieldFailed
source: Failed to update field.
fi_fi: Pellon päivitys epäonnistui.

# RefreshTokenMissing
source: Refresh token must be provided.
fi_fi: Päivitystunnus täytyy olla pyynnössä.

# PasswordTooShort
source: Passwords must be at least 6 characters.
fi_fi: Salasanan tulee olla vähintään {0} merkkiä pitkä.

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
fi_fi: Salasanassa täytyy olla vähintään yksi erikoismerkki.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
fi_fi: Salasanassa täytyy olla ainakin yksi numero ('0'-'9').

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
fi_fi: Salasanassa täytyy olla ainakin yksi iso kirjain ('A'-'Z').

# DuplicateUserName
source: Username {0} is already taken.
fi_fi: Käyttäjänimi '{0}' ei ole vapaana.
